# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1  # model depth multiple
width_multiple: 1  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
#  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [8, 3, 2]],   # 0-P1/2
   [-1, 1, Conv, [8, 3, 1]],   # 1
   [-1, 1, Conv, [16, 3, 2]],  # 2-P2/4
   [-1, 1, Conv, [16, 3, 1]],  # 3
   [-1, 1, Conv, [32, 3, 2]],  # 4-P3/8
   [-1, 1, Conv, [32, 3, 1]],  # 5
   [-1, 1, Conv, [64, 3, 2]],  # 6-P4/16
  ]


# YOLOv5 v6.0 head
head:
  [ [-1, 1, DWPWConv, [32, 1, 1]],  # 7

    [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 8
    [ 5, 1, DWPWConv, [32, 1, 1]],  # 9
    [[8, -1], 1, Concat, [1]],  # 10 # cat backbone p4
    [-1, 1, GhostBottleneck, [32, 3, 1]],  # 11

    [-1, 1, DWPWConv, [32, 5, 2, 2]],  # 12 # Downsample
    [[-1, 7], 1, Concat, [1]], # 13  # cat head p4
    [-1, 1, GhostBottleneck, [32, 3, 1]], # 14 (P4/16-medium)
    # ADD DW-PW INTO EVERY LAYER BEFORE HEAD
    [-1, 1, DWPWConv, [32, 3, 1]],  # 15
    [-1, 1, DWPWConv, [32, 3, 1]],  # 16
    [-1, 1, DWPWConv, [32, 3, 1]],  # 17

    [11, 1, DWPWConv, [32, 3, 1]],  # 18
    [-1, 1, DWPWConv, [32, 3, 1]],  # 19
    [-1, 1, DWPWConv, [32, 3, 1]],  # 20
    [[20, 17], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)  #21
  ]
