# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64,  6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, Conv, [128, 3, 1]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, Conv, [256, 3, 1]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, Conv, [512, 3, 1]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, Conv, [1024, 3, 1]],
   [-1, 1, Conv, [1024, 3, 1]],  # 9
  ]


# YOLOv5 v6.0 head
head:
  [ [-1, 1, Conv, [512, 1, 1]],  # 10
    [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 11
    [[-1, 6], 1, Concat, [1]],  # 12 # cat backbone p4
    [-1, 3, GhostBottleneck, [512, 3, 1]],  # 13

    [-1, 1, Conv, [256, 1, 1]], #14
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 15
    [[-1, 4], 1, Concat, [1]],   # 16 # cat backbone p3
    [-1, 3, GhostBottleneck, [256, 3, 1]],  # 17 (P3/8-small)

    [-1, 1, Conv, [256, 3, 2]],  # 18 # Downsample
    [[-1, 14], 1, Concat, [1]], # 19  # cat head p4
    [-1, 3, GhostBottleneck, [512, 3, 1]], # 20 (P4/16-medium)

    [-1, 1, Conv, [512, 3, 2]],  # 21  # Downsample
    [[-1, 10], 1, Concat, [1]],  # 22  # cat head P5
    [-1, 3, GhostBottleneck, [1024, 3, 1]], # 23 (P5/32-large)

    [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
